In [1]:
import pandas as pd
import numpy as np
from warnings import filterwarnings
filterwarnings('ignore')

In [2]:
# Handling Missing Data
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [5]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [6]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], 
                     [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [8]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [9]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [10]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [11]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4,1] = NA
df.iloc[:2,2] = NA
df

          0         1         2
0  1.562540       NaN       NaN
1 -0.365652       NaN       NaN
2  0.481375       NaN  0.024615
3 -2.165675       NaN -3.000883
4  0.991147  0.139694  0.741591
5  0.683546  2.145207  0.743106
6  0.508418 -0.303690  0.102479

In [13]:
df.dropna()

          0         1         2
4  0.991147  0.139694  0.741591
5  0.683546  2.145207  0.743106
6  0.508418 -0.303690  0.102479

In [14]:
df.dropna(thresh=2)

          0         1         2
2  0.481375       NaN  0.024615
3 -2.165675       NaN -3.000883
4  0.991147  0.139694  0.741591
5  0.683546  2.145207  0.743106
6  0.508418 -0.303690  0.102479

In [15]:
df.fillna(0)

          0         1         2
0  1.562540  0.000000  0.000000
1 -0.365652  0.000000  0.000000
2  0.481375  0.000000  0.024615
3 -2.165675  0.000000 -3.000883
4  0.991147  0.139694  0.741591
5  0.683546  2.145207  0.743106
6  0.508418 -0.303690  0.102479

In [16]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  1.562540  0.500000  0.000000
1 -0.365652  0.500000  0.000000
2  0.481375  0.500000  0.024615
3 -2.165675  0.500000 -3.000883
4  0.991147  0.139694  0.741591
5  0.683546  2.145207  0.743106
6  0.508418 -0.303690  0.102479

In [17]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0  1.562540  0.000000  0.000000
1 -0.365652  0.000000  0.000000
2  0.481375  0.000000  0.024615
3 -2.165675  0.000000 -3.000883
4  0.991147  0.139694  0.741591
5  0.683546  2.145207  0.743106
6  0.508418 -0.303690  0.102479

In [18]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  0.736605  1.790644  0.281985
1  0.727919  1.129758  0.246783
2  1.379232       NaN -0.597049
3  0.449612       NaN  1.311155
4 -0.564600       NaN       NaN
5 -0.552568       NaN       NaN

In [19]:
df.fillna(method='ffill')

          0         1         2
0  0.736605  1.790644  0.281985
1  0.727919  1.129758  0.246783
2  1.379232  1.129758 -0.597049
3  0.449612  1.129758  1.311155
4 -0.564600  1.129758  1.311155
5 -0.552568  1.129758  1.311155

In [20]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.736605  1.790644  0.281985
1  0.727919  1.129758  0.246783
2  1.379232  1.129758 -0.597049
3  0.449612  1.129758  1.311155
4 -0.564600       NaN  1.311155
5 -0.552568       NaN  1.311155

In [21]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [22]:
# Data Transformation
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [23]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [24]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [25]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [26]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [27]:
# Transforming Data Using a Function or Mapping
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [28]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [29]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [30]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [31]:
data['food'].map(lambda x:meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [32]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [33]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [34]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [35]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [36]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [37]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [38]:
transform = lambda x : x[:4].upper()

In [39]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [40]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [41]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [42]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [43]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [44]:
# Discretization and Binning
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [45]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [46]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [47]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [48]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64, left]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [49]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [50]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.019, 0.26], (0.73, 0.96], (0.49, 0.73], (0.49, 0.73], (0.73, 0.96], ..., (0.73, 0.96], (0.73, 0.96], (0.26, 0.49], (0.26, 0.49], (0.49, 0.73]]
Length: 20
Categories (4, interval[float64, right]): [(0.019, 0.26] < (0.26, 0.49] < (0.49, 0.73] < (0.73, 0.96]]

In [51]:
data = np.random.randn(1000) 
cats = pd.qcut(data, 4)  
cats

[(-0.00442, 0.633], (-3.46, -0.674], (-0.00442, 0.633], (0.633, 3.122], (0.633, 3.122], ..., (0.633, 3.122], (-3.46, -0.674], (-0.674, -0.00442], (-3.46, -0.674], (0.633, 3.122]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.46, -0.674] < (-0.674, -0.00442] < (-0.00442, 0.633] < (0.633, 3.122]]

In [52]:
pd.value_counts(cats)

(-3.46, -0.674]       250
(-0.674, -0.00442]    250
(-0.00442, 0.633]     250
(0.633, 3.122]        250
dtype: int64

In [53]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-0.00442, 1.284], (-1.269, -0.00442], (-0.00442, 1.284], (-0.00442, 1.284], (-0.00442, 1.284], ..., (-0.00442, 1.284], (-1.269, -0.00442], (-1.269, -0.00442], (-1.269, -0.00442], (-0.00442, 1.284]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.46, -1.269] < (-1.269, -0.00442] < (-0.00442, 1.284] < (1.284, 3.122]]

In [54]:
# Detecting and Filtering Outliers
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.011386     0.028150     0.042344    -0.011421
std       0.991984     1.037798     0.996680     1.004733
min      -3.162408    -3.127593    -3.054674    -3.436333
25%      -0.638580    -0.678309    -0.648247    -0.605431
50%      -0.012999     0.008451     0.044206    -0.000575
75%       0.695233     0.734115     0.747396     0.663234
max       3.021993     3.381503     3.145079     3.056684

In [55]:
col = data[2]
col[np.abs(col) > 3]

93     3.145079
897   -3.054674
Name: 2, dtype: float64

In [56]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
76  -3.162408  1.302640 -1.318648  0.434213
93  -0.790201 -2.231926  3.145079 -0.716430
292 -1.194938 -0.155427 -2.025299 -3.436333
454  3.021993  1.055475  1.019986  1.265975
633 -0.270506 -2.418883 -0.276220 -3.228140
733  1.020303 -3.127593 -0.560673 -0.031815
789  0.867236 -1.301343 -1.345780  3.056684
897  0.940825  0.044738 -3.054674 -1.310767
921  0.652856 -1.013938  0.118826 -3.214876
995 -0.641306  3.381503 -1.385968 -0.147309

In [57]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.011526     0.027896     0.042253    -0.010598
std       0.991411     1.036252     0.996070     1.001795
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.638580    -0.678309    -0.648247    -0.605431
50%      -0.012999     0.008451     0.044206    -0.000575
75%       0.695233     0.734115     0.747396     0.663234
max       3.000000     3.000000     3.000000     3.000000

In [58]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0 -1.0  1.0
1 -1.0  1.0  1.0 -1.0
2 -1.0 -1.0  1.0 -1.0
3 -1.0  1.0 -1.0 -1.0
4  1.0 -1.0  1.0 -1.0

In [59]:
# Permutation and Random Sampling
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
sampler = np.random.permutation(5)
sampler

array([2, 0, 4, 3, 1])

In [60]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [61]:
df.take(sampler)

    0   1   2   3
2   8   9  10  11
0   0   1   2   3
4  16  17  18  19
3  12  13  14  15
1   4   5   6   7

In [62]:
df.sample(n=3)

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [63]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

0    5
1    7
3    6
3    6
3    6
1    7
1    7
4    4
3    6
2   -1
dtype: int64

In [64]:
# Computing Indicator/Dummy Variables
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [65]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [66]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [67]:
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [68]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('./Folder/datasets/movielens/movies.dat', sep='::',
                       header=None, names=mnames)
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [69]:
all_genres = []
for x in movies.genres:
    all_genres.extend(x.split('|'))
genres = pd.unique(all_genres)
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [70]:
zero_matrix = np.zeros((len(movies), len(genres)))
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [71]:
gen = movies.genres[0]
gen.split('|')

['Animation', "Children's", 'Comedy']

In [72]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [73]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [74]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                              1.0
Genre_Children's                             1.0
Genre_Comedy                                 1.0
Genre_Adventure                              0.0
Genre_Fantasy                                0.0
Genre_Romance                                0.0
Genre_Drama                                  0.0
Genre_Action                                 0.0
Genre_Crime                                  0.0
Genre_Thriller                               0.0
Genre_Horror                                 0.0
Genre_Sci-Fi                                 0.0
Genre_Documentary                            0.0
Genre_War                                    0.0
Genre_Musical                                0.0
Genre_Mystery                                0.0
Genre_Film-Noir                              0.0
Genre_Western                                0.0
Name: 0, dtype: object

In [75]:
np.random.seed(12345)
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [76]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [77]:
# String Manipulation
val = 'a,b,  guido'
val.split(',')

['a', 'b', '  guido']

In [78]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [79]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [80]:
'::'.join(pieces)

'a::b::guido'

In [81]:
'guido' in val

True

In [82]:
val.index(',')

1

In [83]:
val.find(':')

-1

In [84]:
# val.index(':')
val.count(',')

2

In [85]:
val.replace(',', '::')

'a::b::  guido'

In [86]:
val.replace(',', '')

'ab  guido'

In [87]:
# Regular Expressions
import re
text = "foo    bar\t baz  \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [88]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [89]:
regex.findall(text)

['    ', '\t ', '  \t']

In [90]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

regex = re.compile(pattern, flags=re.IGNORECASE)

In [91]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [92]:
m = regex.search(text)
m

In [93]:
text[m.start():m.end()]

'dave@google.com'

In [94]:
print(regex.match(text))

None

In [95]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [96]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [97]:
m = regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

In [98]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [99]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [100]:
# Vectorized String Functions in pandas
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [101]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [102]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [103]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [104]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [105]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [106]:
# matches.str.get(1)
# matches.str[0]
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object